* Agassiz 84 borehole
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS:
#+begin_example
Name                                  | agassiz84
Alternate name                        | Agassiz 1984 borehole
Data source                           | WIC Email
Drill year(s)                         | 184 (Vinther, 2008)
Data year(s)                          | 1984
Longitude [°E]                        | -73.1
Latitude [°N]                         | 80.7
Approximate location name             | Agassiz Ice Cap
Location source                       | Vinther, 2008
Ice thickness [m]                     | 127.6
Ice thickness year                    | nan
Ice thickness source                  | See data source
Surface velocity [m yr^-1]            | nan
Surface velocity year                 | nan
Surface velocity source               | nan
Measured from: Top, Bottom, Relative  | T
Depth of top measurement [m]          | 3.0
Depth of bottom measurement [m]       | 128.0
Coverage [% of thickness]             | 98
#+end_example

** Temperature

+ Data provided by 3rd party in XLSX format, converted to CSV.
+ WIC Email: [[mu4e:msgid:AM0PR04MB6129DE88C9253A951702EE06A2F30@AM0PR04MB6129.eurprd04.prod.outlook.com][Agassiz x4]]
+ See also [[citet:clarke_1987_wind][Clark (1987)]] Figure 2.

#+BEGIN_example
From: William Colgan
To: Ken Mankoff
Subject: Agassiz x4
Date: Wed 02 Dec 2020 04:54:17 AM PST
Attachments: [1]Agassiz borehole T profiles.xlsx(19.6K)

Here are 4x Agassiz Ice Cap temperature profiles. All to bedrock, and
all from within 2 km of the same 80.70N and 73.10W coordinate in the
file.

Fra: Christian Zdanowicz
Sendt: 2. december 2020 13:27
Til: William Colgan <wic@geus.dk>
Emne: RE: Prince of Wales - ice temperature?

The Agassiz T profiles are from the 1977, 1979 and 1984 boreholes, all
down to bedrock. I do not have more precise information on the
measurements or on the location of the boreholes than what was
published (see other attached papers).

David Fisher deserves the credit for all these data, I did not
generate them. You can use his Univ. of Ottawa affiliation: Department
of Earth and Environmental Sciences, University of Ottawa, Ottawa,
Canada, K1N 6N5.
#+END_example

** Thickness

From email (above) stating that profile goes to bedrock.

** Location

Provided in email. Note: "within 2 km of".

** Velocity

Unknown

** Data                                                 :noexport:

#+BEGIN_SRC bash :exports results
cat data.csv| sort -t, -n -k1
#+END_SRC

#+RESULTS:
|     d |      t |
|   2.6 | -23.99 |
|   7.6 | -22.41 |
|  12.6 | -21.88 |
|  17.6 | -21.76 |
|  22.6 | -21.61 |
|  27.6 | -21.52 |
|  32.6 | -21.39 |
|  37.6 | -21.28 |
|  42.6 | -21.09 |
|  47.6 |  -21.0 |
|  52.6 |  -20.9 |
|  57.6 |  -20.8 |
|  62.6 | -20.68 |
|  67.6 | -20.55 |
|  72.6 | -20.44 |
|  77.6 | -20.33 |
|  82.6 | -20.22 |
|  87.6 | -20.09 |
|  92.6 | -19.97 |
|  97.6 | -19.84 |
| 102.6 | -19.71 |
| 107.6 |  -19.6 |
| 112.6 | -19.48 |
| 117.6 | -19.34 |
| 122.6 | -19.23 |
| 127.6 |  -19.1 |

